# Structured Query Language (SQL)

We now know that DBMS acts as an interface between us and the database and helps to convert our request so that the database can understand it. But how do we talk to the DBMS. We use a special language called **SQL**. 

>**Structured Query Language (SQL) is a programming language** designed to **get information out of and put it into a relational database**.

![sql_funny](images/sql_funny.png)

Our two databases and the corresponding tables are shown below. You can select the database and tables to get an idea about the data types as well as the data content in each tables.

In [10]:
import displaydatabases
from questiondisplay import QueryWindow
disp = displaydatabases.Display()
disp.displayDatabases

VBox(children=(HBox(children=(Output(layout=Layout(max_width='30%')), VBox(children=(Dropdown(description='Dat…

## Talking to a Database using SQL

### 1. Selecting records from one or more tables in a database

>**Select statement** is used to **retrieve data from a Database** 

The general **syntax** for **select statement** is 

```mysql
select column1,column2..columnN from table_name
```

Where column1, column2 are the columns that you want to select from the table (with name table_name)

#### 1.1 Select All Columns from a Table

The syntax for selecting all columns from a table is

```mysql
select * from table_name
```
The <b>*</b> symbol indicates that we would want all the columns from the table. 

Let's look at a concrete example.

![select(*) from](images/SELECT_STAR.png) 

We have a table BigCats which contains five records (rows) and has four columns. The query
```mysql
select * from BigCats
```
will retrieve all the rows and columns from the BigCats table

Now you can try out exercises based on the select * query below

**1. Select all columns from actor table**

In [11]:
QueryWindow(1).display()

VBox(children=(HBox(children=(Output(), Textarea(value='', placeholder='Type your Query here'), Button(descrip…

**2. Select all columns from staff table**

In [12]:
QueryWindow(2).display()

VBox(children=(HBox(children=(Output(), Textarea(value='', placeholder='Type your Query here'), Button(descrip…

#### 1.2 Select subset of columns from a table

The syntax for selecting subset of columns from a table is

```mysql
select column1,column2...columnN from table_name
```
Let's look at a concrete example.

![select COLUMN from](images/SELECT_COLUMN.png) 

The query
```mysql
select name from BigCats
```
will retrieve the single column 'name' and the 5 records associated with it.

Try out more examples as given below

**3. Select staff_id,first_name and last_name from staff table**

In [13]:
QueryWindow(3).display()

VBox(children=(HBox(children=(Output(), Textarea(value='', placeholder='Type your Query here'), Button(descrip…

**4. Select first_name and last_name from actor table**

In [14]:
QueryWindow(4).display()

VBox(children=(HBox(children=(Output(), Textarea(value='', placeholder='Type your Query here'), Button(descrip…

#### 1.3 Select distinct values from a column

The **syntax** for **select distinct statement** is 

```mysql
select distinct column1,column2..columnN from table_name
```

Where column1, column2, columnN are the columns that you want to select from the table (with name table_name) and only distinct values for column1 will be selected

Let's see a concrete example.

![select distinct from](images/distinct.png) 

The query
```mysql
select distinct state from Salary
```
will retrieve the unique states from the state column

Try out more examples given below

**5. Select the unique set of cities from employees table**

In [15]:
QueryWindow(5).display()

VBox(children=(HBox(children=(Output(), Textarea(value='', placeholder='Type your Query here'), Button(descrip…

### 2. Filter Records with where clause

The **where clause** is used to extract records that meets a specified condition. It is one of the most powerful feature of an SQL query.

The syntax for where clause is 

```mysql
SELECT column1, column2, ..columnN
FROM table_name
WHERE condition;
```

Let's look at some concrete examples

![where I](images/whereI.png) 

The query
```mysql
select * from Salary where salary>200000
```
will retrieve all rows and columns (since we are using \*) that matches the criteria that salary should be greater than 200000 (which is 2 rows)

Let's look at another example

![where I](images/whereII.png) 

The query
```mysql
select * from Salary where Job_Title = 'Doctor'
```
will retrieve all rows and columns (since we are using \*) that matches the criteria that Job_Title is 'Doctor'. 

**Note** since Job_Title is of data type Text, we use single quotes while querying. Since salary is numercical we don't need quotes. 

Try out more examples as given below

**6. From film table select films having length more than 100 minutes**

In [16]:
QueryWindow(6).display()

VBox(children=(HBox(children=(Output(), Textarea(value='', placeholder='Type your Query here'), Button(descrip…

**7. Select all actors with first name JENNIFER FROM actor table**

In [17]:
QueryWindow(7).display()

VBox(children=(HBox(children=(Output(), Textarea(value='', placeholder='Type your Query here'), Button(descrip…

**8. Select all employees from the employees table who are from Calgary city**

In [18]:
QueryWindow(8).display()

VBox(children=(HBox(children=(Output(), Textarea(value='', placeholder='Type your Query here'), Button(descrip…

#### 2.1 AND, OR, NOT for filtering based on multiple conditions

The AND and OR operators are used for filtering records based on more than one condition.

The AND operator displays a record if **all the conditions separated by AND are True**

The **syntax for AND operator** is 

```mysql
SELECT column1, column2, ..columnN
FROM table_name
WHERE condition1 AND condition2 AND condition3...
```

The OR operator displays a record if **any of the conditions separated by OR is True**.

The **syntax for OR operator** is 

```mysql
SELECT column1, column2, ..columnN
FROM table_name
WHERE condition1 OR condition2 OR condition3...
```

The NOT operator displays a record if the **condition(s) is NOT TRUE**.

The **syntax for NOT operator** is 

```mysql
SELECT column1, column2, ..columnN
FROM table_name
WHERE NOT condition;
```
Lets look at some examples

![AND](images/AND.png) 

The query
```mysql
select * from Salary where state = 'New York' and salary>200000
```
will retrieve all rows and columns (since we are using \*) that matches the criteria that state is 'New York' (again this is Text) and has a salary greater than 200000 (we have only one such record)

![OR](images/OR.png) 

In this example we are using the OR operator

The query
```mysql
select * from Salary where state = 'New York' or state = 'Ohio'
```
will retrieve all rows and columns that matches the criteria that state is 'New York'  **OR** state is 'Ohio'. We have three such records (2 from New York and 1 from Ohio)

![NOT](images/NOT.png) 

In this example we are using the NOT operator

The query
```mysql
select * from Salary where not Job_Title = 'Doctor'
```
will retrieve all rows and columns that matches the criteria that Job_Title is not 'Doctor'. We have three such records with Job_Title not as Doctor.

Try out the examples given below

**9. Retrieve employees with title as Sales Manager *and* city as Calgary**

In [19]:
QueryWindow(9).display()

VBox(children=(HBox(children=(Output(), Textarea(value='', placeholder='Type your Query here'), Button(descrip…

**10. Retrieve all films from film table with length greater than 100 minutes and rating equals to PG**

In [20]:
QueryWindow(10).display()

VBox(children=(HBox(children=(Output(), Textarea(value='', placeholder='Type your Query here'), Button(descrip…

**11. Retrieve all films from film table with length greater than 100 minutes *or* rating equals to PG**

In [21]:
QueryWindow(11).display()

VBox(children=(HBox(children=(Output(), Textarea(value='', placeholder='Type your Query here'), Button(descrip…

**12. Select all invoices from invoices table where BillingCountry is either Canada and USA**

In [22]:
QueryWindow(12).display()

VBox(children=(HBox(children=(Output(), Textarea(value='', placeholder='Type your Query here'), Button(descrip…

**13. Select all invoices from invoices table where Total is greater than 1 and less than 5 or total greater than 10 and less than 100**

In [23]:
QueryWindow(13).display()

VBox(children=(HBox(children=(Output(), Textarea(value='', placeholder='Type your Query here'), Button(descrip…

**14. Select all invoices from invoices table that have BillingCountry other than Canada**

In [24]:
QueryWindow(14).display()

VBox(children=(HBox(children=(Output(), Textarea(value='', placeholder='Type your Query here'), Button(descrip…

### 3. Order records using Order By

Order by keyword is used to **sort query results by ascending or descending**

The syntax for Order by is 

```mysql
SELECT column1, column2, ..columnN
FROM table_name
ORDER BY column1, column2, ... ASC|DESC;
```

Lets look at an example

![DESC](images/DESC.png) 

The query
```mysql
select * from Salary order by salary desc
```
will retrieve all rows and columns and order them by salary in decreasing order (highest first).

If you want to order the table by salary in ascending order (lowest first), the query will be

```mysql
select * from Salary order by salary asc
```

or you can even write

```mysql
select * from Salary order by salary
```

As by default the ordering will be in ascending.

Try out the examples given below

**15. Select first_name and last_name from actor table and sort by actor first_name ascending**

In [25]:
QueryWindow(15).display()

VBox(children=(HBox(children=(Output(), Textarea(value='', placeholder='Type your Query here'), Button(descrip…

**16. Sort payment table by amount in descending order**

In [26]:
QueryWindow(16).display()

VBox(children=(HBox(children=(Output(), Textarea(value='', placeholder='Type your Query here'), Button(descrip…

**17. Select first_name and last_name from actor table and sort by actor first_name ascending and actor last_name descending**

In [27]:
QueryWindow(17).display()

VBox(children=(HBox(children=(Output(), Textarea(value='', placeholder='Type your Query here'), Button(descrip…

### 4. Finding Minimum, Maximum, Average, Sum and Count for Columns

Aggregate functions **min(), max(), avg(), sum(), and count()** can be used to find the Minimum, Maximum, Average, Sum and Count for a selected column

Syntax for **min()**

```mysql
SELECT MIN(column_name) FROM table_name
```

Syntax for **max()**

```mysql
SELECT MAX(column_name) FROM table_name
```

Syntax for **avg()**

```mysql
SELECT AVG(column_name) FROM table_name
```

Syntax for **sum()**

```mysql
SELECT sum(column_name) FROM table_name
```

Syntax for **count()**

```mysql
SELECT count(column_name) FROM table_name
```

Let's look at some concrete examples

![count](images/count.png) 

count(\*) returns the number of rows returned by the select statement. In this example the query

```mysql
SELECT count(*) FROM Salary where salary>200000
```

will return a column with name count(\*) with a single row having value of 2 (because there are only 2 records with salary greater than 200000). If the query was

```mysql
SELECT count(*) FROM Salary where state = 'Ohio'
```

the value will be 1

Now let's look at an example for min() function

![min](images/min.png) 

This query

```mysql
SELECT min(salary) FROM Salary
```

Returns the minimum value from the salary column in the Salary table (which is 110000).

![max](images/max.png) 

Similarly the max() function returns the maximum value for the particular column (salary) from the table (Salary)

![avg](images/avg.png) 

As the name implies the avg() function returns the average of the values for the particular column. For example the query

```mysql
SELECT avg(salary) FROM Salary where Job_Title = 'Computer Scientist'
```

returns the average salary where the Job_Title is 'Computer Scientist'

![sum](images/sum.png) 

The sum() function returns the sum of the values in the particular column. The query

```mysql
SELECT sum(salary) FROM Salary where Job_Title = 'Doctor'
```
returns the sum of values in the salary column where the Job_Title is 'Doctor'

Try out the examples to get a better understanding of the aggregate functions

**18. Select minimum amount from payment table.**

In [28]:
QueryWindow(18).display()

VBox(children=(HBox(children=(Output(), Textarea(value='', placeholder='Type your Query here'), Button(descrip…

**19. Select maximum amount from payment table.**

In [29]:
QueryWindow(19).display()

VBox(children=(HBox(children=(Output(), Textarea(value='', placeholder='Type your Query here'), Button(descrip…

**20. Select average amount from payment table.**

In [30]:
QueryWindow(20).display()

VBox(children=(HBox(children=(Output(), Textarea(value='', placeholder='Type your Query here'), Button(descrip…

**21. Select total amount from payment table.**

In [31]:
QueryWindow(21).display()

VBox(children=(HBox(children=(Output(), Textarea(value='', placeholder='Type your Query here'), Button(descrip…

**22. Select how many records in payment table.**

In [32]:
QueryWindow(22).display()

VBox(children=(HBox(children=(Output(), Textarea(value='', placeholder='Type your Query here'), Button(descrip…

**23. Select grant total of Total from invoices where BillingCountry is Germany.**

In [33]:
QueryWindow(23).display()

VBox(children=(HBox(children=(Output(), Textarea(value='', placeholder='Type your Query here'), Button(descrip…

**24. Select total number of employees with a title General Manager from employees table**

In [34]:
QueryWindow(24).display()

VBox(children=(HBox(children=(Output(), Textarea(value='', placeholder='Type your Query here'), Button(descrip…

**25. Select total number of employees with a Country Canada from employees table**

In [35]:
QueryWindow(25).display()

VBox(children=(HBox(children=(Output(), Textarea(value='', placeholder='Type your Query here'), Button(descrip…

### 5. Grouping Records together by Group By statement

The Group By statement is used to **arrange identical data into groups**. The group by clause follows the where clause (if it's present) and precedes the order by clause (if it's present). For example you want to aggregate the total number of invoices by Country, or you want to get the count of employees with different Title (how many General Manager, Sales Manager etc)

The Group By statement is often used with aggregate functions (COUNT(), MAX(), MIN(), SUM(), AVG()) to group the result-set by one or more columns.

The syntax for Group By statement

```mysql
SELECT column_name(s)
FROM table_name
WHERE condition
GROUP BY column_name(s)
ORDER BY column_name(s)
```

The where condition and order by are optional and depends up on the use-case.

Let's look at some examples

![groupcount](images/groupbycount.png) 

In this example we are grouping by the column State and then applying the aggregate function count()

The query 

```mysql
SELECT State,count(*) from Salary group by State
```

returns the count of each state in the table. You can think of count(\*) as being applied to each set of states grouped together. We have four different states with two states having count 2 and 2 states having count of 1. 

**Point to Ponder**

This will give just the state name and the count. What if we were able to Map the counts. Then we could see whether there are any spatial patterns. This is the power of spatial data. The ability to map gives you the flexibility to look at the data from a completely new perspective. We will look at how this is possible in the next chapter.

![groupavg](images/groupbyavg.png) 

In this query

```mysql
SELECT Job_Title,avg(salary) from Salary group by Job_Title
```
we are calculating the average salary for each Job_Title. We have two Job_Title (that of Computer Scientist and Doctor).

![groupsum](images/groupbysum.png) 

This query

```mysql
SELECT Job_Title,sum(salary) from Salary group by Job_Title
```

is very similar to the avg() query, but here we are calculating the sum of salaries (which might not be a useful result in reality).

![groupmax](images/groupbymax.png) 

By this query
```mysql
SELECT Job_Title,max(salary) from Salary group by Job_Title
```
we select the maximum salary for each Job_Title.

![groupmin](images/groupbymin.png) 

and by this query

```mysql
SELECT Job_Title,min(salary) from Salary group by Job_Title
```
we select the minimum salary for each Job_Title.

Now you can try out the queries given below

**26. Select sum Total of invoices for each BillingCountry**

In [36]:
QueryWindow(26).display()

VBox(children=(HBox(children=(Output(), Textarea(value='', placeholder='Type your Query here'), Button(descrip…

**27. Select number of invoices for each BillingCountry**

In [37]:
QueryWindow(27).display()

VBox(children=(HBox(children=(Output(), Textarea(value='', placeholder='Type your Query here'), Button(descrip…

**28. select average length of films from film table grouped on rating.**

In [38]:
QueryWindow(28).display()

VBox(children=(HBox(children=(Output(), Textarea(value='', placeholder='Type your Query here'), Button(descrip…

**29. Select maximum rental_rate of films from film table grouped on rating.**

In [39]:
QueryWindow(29).display()

VBox(children=(HBox(children=(Output(), Textarea(value='', placeholder='Type your Query here'), Button(descrip…

**30. Select average rental_rate for each rating for each release_year.**

In [40]:
QueryWindow(30).display()

VBox(children=(HBox(children=(Output(), Textarea(value='', placeholder='Type your Query here'), Button(descrip…

**31. Select total number of invoices for each BillingCity for the BillingCountry Germany.**

In [41]:
QueryWindow(31).display()

VBox(children=(HBox(children=(Output(), Textarea(value='', placeholder='Type your Query here'), Button(descrip…

**32. Select sum total of Total for invoices for each BillingCity for the BillingCountry Germany and order the records by the sum total in descending order.**

In [42]:
QueryWindow(32).display()

VBox(children=(HBox(children=(Output(), Textarea(value='', placeholder='Type your Query here'), Button(descrip…

### 6. Aliases for providing Temporary Name

Aliases are used to give a **table or column in a table a temporary name**. Most of the time aliases are used to make the **query more readable**. Aliases **only exists until the query is running**.  

The syntax for column alias is 

```mysql
SELECT column_name AS alias_name
FROM table_name;
```

And syntax for table alias is 

```mysql
SELECT column_name
FROM table_name as alias_name;
```

Let's look at some examples

![columnalias](images/columnalias.png) 

In this query

```mysql
SELECT Job_Title,min(salary) as MIN_SALARY from Salary group by Job_Title
```
we are using an alias name for the column min(salary) (which is part of the result) as MIN_SALARY. Eventhough it doesn't change anything to the result, it makes the result more readable. 

Next we look at how we can use table alias in an effective way.

![tablealias](images/tablealias.png) 

In this query 

```mysql
SELECT s.Job_Title,s.salary from Salary as s where s.state
```
we are setting an alias name 's' for the table Salary. Notice how we use the '.' operator to access the columns. This is particularly useful when we are joining multiple tables (about which we will learn in the last section). 

Try out the examples given below

**33. Select sum total of Total for invoices for each BillingCity for the BillingCountry Germany and order the records by the sum total in descending order. Name the sum total of Total as TotalAmount**

In [43]:
QueryWindow(33).display()

VBox(children=(HBox(children=(Output(), Textarea(value='', placeholder='Type your Query here'), Button(descrip…

**34. Select total number of invoices for each BillingCity for the BillingCountry Germany. Name the total number of invoices column as TotalInvoices**

In [44]:
QueryWindow(34).display()

VBox(children=(HBox(children=(Output(), Textarea(value='', placeholder='Type your Query here'), Button(descrip…

In the next section we will learn about joins and how to interact with the database through Python.